In [1]:
import pandas as pd

In [2]:
db = pd.read_csv("bakers.s.tsv", sep = "\t", header = None)
db

             0       1
0       P08539  P18851
1       P11433  P18852
2       P11433  P21268
3       P11433  P18851
4       P18851  P18852
...        ...     ...
109681  Q07821  Q12425
109682  P47158  Q12425
109683  P47158  Q07821
109684  P47158  Q12425
109685  P47158  Q07821

[109686 rows x 2 columns]

In [3]:
dbprots = set(db[0]).union(db[1])
len(dbprots)

6478

In [4]:
dfb = pd.read_csv("fly-bakers.tsv", sep = "\t")
dfb

             fly  bakers     score
0     A0A0B4K7J2  P32499  0.033223
1     A0A0B4K7J2  P40517  0.033033
2     A0A0B4K7J2  P41920  0.044461
3         A1Z6J5  P39937  0.041991
4         A1Z6K7  Q08723  0.032133
...          ...     ...       ...
8353      Q9Y1I2  P38932  0.031137
8354      X2JDY8  P38339  0.031469
8355      X2JDY8  P39083  0.032654
8356      X2JDY8  P39960  0.035592
8357      X2JDY8  Q06407  0.033863

[8358 rows x 3 columns]

In [5]:
dbp = set(dfb.iloc[:, 1])
len(dbp)

1508

In [6]:
len(dbp.intersection(dbprots))

1508

In [23]:
dbs = db.sample(1000)
dfs = pd.read_csv("fly.s.tsv", sep = "\t", header = None).sample(2000)

In [26]:
import networkx as nx
Gb = nx.from_pandas_edgelist(dbs, 0, 1)
Gf = nx.from_pandas_edgelist(dfs, 0, 1)

bcc = max(nx.connected_components(Gb), key = len)
bff = max(nx.connected_components(Gf), key = len)
bcc = set(bcc)
bff = set(bff)

len(bcc), len(bff)

(562, 740)

In [30]:
'O14455' in bcc

True

In [32]:
dbs = dbs.loc[dbs[0].apply(lambda x: x in bcc) & dbs[1].apply(lambda x: x in bcc), :]
dbs

             0       1
99607   P50875  P06844
101989  P32328  P32565
19228   P38249  P02557
86074   Q12398  P02829
90567   P35177  Q02201
...        ...     ...
1671    Q02754  P15938
60011   P47042  P24783
41981   P40303  P25043
85768   P15108  P14540
17159   P38934  P36105

[593 rows x 2 columns]

In [33]:
dfs = dfs.loc[dfs[0].apply(lambda x: x in bff) & dfs[1].apply(lambda x: x in bff), :]
dfs

            0           1
36959  Q24142  A0A0B4JD55
18451  Q9VJM1      Q9W0F5
44319  Q4QPV8      Q9VIH8
44164  P82701      Q8MLR5
29902  Q9W258      P83100
...       ...         ...
14727  Q9W330      Q9VJU5
2768   Q9VU58      Q9VUT3
19093  Q9VHC7      P92208
26086  Q24568      Q9VIF5
37130  Q24142  A0A0B4KGW2

[754 rows x 2 columns]

In [34]:
dbs.to_csv("../test/bakers.s.tsv", sep = "\t", header = None, index = None)
dfs.to_csv("../test/fly.s.tsv", sep = "\t", header = None, index = None)

In [38]:
dfb1 = dfb.loc[dfb.iloc[:, 0].apply(lambda x:x in bff) & dfb.iloc[:, 1].apply(lambda x:x in bcc)]
dfb1

         fly  bakers     score
314   O18388  Q06142  0.221090
347   O18640  P16649  0.035174
350   O18640  P25635  0.031019
351   O18640  P36037  0.033602
353   O18640  P38129  0.040521
...      ...     ...       ...
8298  Q9W4X7  Q04067  0.056398
8334  Q9XZJ4  P21243  0.113507
8335  Q9XZJ4  P23638  0.073223
8337  Q9XZJ4  P32379  0.055450
8339  Q9XZJ4  P40303  0.058768

[133 rows x 3 columns]

In [39]:
dfb1.to_csv("../test/fly-bakers.tsv", sep = "\t", index = None)